module WomanizerAcception.Scenario.SharedIds

module Characters =
    module Ты =
        let id = "Ты"

    module Блондинка =
        let id = "Блондинка"
        let узнаетОСуществованииБрюнетки = "узнаетОСуществованииБрюнетки"
        let уточняетЛовеласЛиТы = "уточняетЛовеласЛиТы"
        let думаетЧтоБрюнеткаЛжет = "думаетЧтоБрюнеткаЛжет"

    module Брюнетка =
        let id = "Брюнетка"
        let узнаетЧтоТыНаСвиданииСДругой = "узнаетЧтоТыНаСвиданииСДругой"
        let срещиваетРуки = "срещиваетРуки"
        let думаетЧтоБлондинкаЕйНеВерит = "думаетЧтоБлондинкаЕйНеВерит"

    module Бабуля =
        let id = "Бабуля"
        let суетНосНеВСвоиДела = "суетНосНеВСвоиДела"

module Objects =
    module ТарелкаСПирожками =
        let id = "ТарелкаСПирожками"

module Locations =
    module Ресторан =
        let id = "Ресторан"

    module Комната =
        let id = "Комната"

    module Конец =
        let id = "Конец"
